In [18]:
# Exercício baseado na aula - Conhecendo nossos dados e o Panda:

# Utilizando o conjunto de dados "notas", faça o seguinte:

# a) Calcule a média das notas atribuídas pelos usuários.

# b) Conte quantas avaliações foram feitas para cada valor de nota (1, 2, 3, 4 e 5).

# c) Crie uma nova coluna chamada "idade_usuario" e atribua a idade de cada usuário como 25.

# d) Exiba as cinco primeiras avaliações após adicionar a nova coluna.

# e) Renomeie as colunas "usuarioId" e "filmeId" para "userID" e "movieID", respectivamente.

# f) Exiba novamente as cinco primeiras avaliações após renomear as colunas.

In [38]:
import pandas as pd

notas = pd.read_csv("D:\\Documentos\\Alura\\Data Science analise e visualização de dados\\Material Fornecido\\introducao-a-data-science-aula0 (1)\\introducao-a-data-science-aula0\\aula0\\ml-latest-small\\ratings.csv")

In [39]:
notas.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [40]:
notas.columns = ["UsuárioID", "FilmeID", "Nota", "Momento"]

notas.head()

   UsuárioID  FilmeID  Nota    Momento
0          1        1   4.0  964982703
1          1        3   4.0  964981247
2          1        6   4.0  964982224
3          1       47   5.0  964983815
4          1       50   5.0  964982931

In [41]:
# a)

notas["Nota"].mean()

3.501556983616962

In [62]:
# b)

print("Nota 1:", notas["Nota"].value_counts()[1])
print("Nota 2:", notas["Nota"].value_counts()[2])
print("Nota 3:", notas["Nota"].value_counts()[3])
print("Nota 4:", notas["Nota"].value_counts()[4])
print("Nota 5:", notas["Nota"].value_counts()[5])

Nota 1: 2811
Nota 2: 7551
Nota 3: 20047
Nota 4: 26818
Nota 5: 13211

In [65]:
# c - d)

notas["IdadeUsuário"]=25
notas.head()

   UsuárioID  FilmeID  Nota    Momento  IdadeUsuário
0          1        1   4.0  964982703            25
1          1        3   4.0  964981247            25
2          1        6   4.0  964982224            25
3          1       47   5.0  964983815            25
4          1       50   5.0  964982931            25

In [69]:
# e - f)
notas.rename(columns={"UsuárioID": "userID", "FilmeID": "movieID"}, inplace=True)
notas.head()

   userID  movieID  Nota    Momento  IdadeUsuário
0       1        1   4.0  964982703            25
1       1        3   4.0  964981247            25
2       1        6   4.0  964982224            25
3       1       47   5.0  964983815            25
4       1       50   5.0  964982931            25